In [1]:
import numpy as np
import pandas as pd

In [2]:
from numpy.random import randn

In [3]:
np.random.seed(101)

In [4]:
dane = {'Firmy':['SAM','SAM','APP','APP','SON','SON'],
       'Osoby':['Basia','Kasia','Jasiek','Kazik','Ania','Staś'],
       'Sprzedaż':[200,120,340,124,243,350]}

In [5]:
df = pd.DataFrame(dane)

In [6]:
df

  Firmy   Osoby  Sprzedaż
0   SAM   Basia       200
1   SAM   Kasia       120
2   APP  Jasiek       340
3   APP   Kazik       124
4   SON    Ania       243
5   SON    Staś       350

In [7]:
df.groupby('Firmy')

In [8]:
byComp = df.groupby('Firmy')

In [9]:
byComp.mean()

       Sprzedaż
Firmy
APP       232.0
SAM       160.0
SON       296.5

In [10]:
byComp.sum()

       Sprzedaż
Firmy
APP         464
SAM         320
SON         593

In [11]:
byComp.std() # odchylenie standardowe

         Sprzedaż
Firmy
APP    152.735065
SAM     56.568542
SON     75.660426

In [12]:
# wydobycie konkretnej danej:
byComp.sum().loc['APP']

Sprzedaż    464
Name: APP, dtype: int64

In [13]:
# przedstawienie powyższych linijek w jednej:
df.groupby('Firmy').sum().loc['APP']

Sprzedaż    464
Name: APP, dtype: int64

In [14]:
# można także pogrupować w taki sposób, aby wykazać, kto miał największą sprzedaż w firmie:
df.groupby('Firmy').max()

       Osoby  Sprzedaż
Firmy
APP    Kazik       340
SAM    Kasia       200
SON     Staś       350

In [16]:
df.groupby('Firmy').describe() # wyświetla podsawowe informacjie

      Sprzedaż
         count   mean         std    min     25%    50%     75%    max
Firmy
APP        2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0
SAM        2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
SON        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0

In [20]:
df.groupby('Firmy').describe().transpose() # wyświetla w firmy w postaci kolumn zamiat indeksów

Firmy                  APP         SAM         SON
Sprzedaż count    2.000000    2.000000    2.000000
         mean   232.000000  160.000000  296.500000
         std    152.735065   56.568542   75.660426
         min    124.000000  120.000000  243.000000
         25%    178.000000  140.000000  269.750000
         50%    232.000000  160.000000  296.500000
         75%    286.000000  180.000000  323.250000
         max    340.000000  200.000000  350.000000

In [22]:
# można także wyświetlić informacje o jedenj firmie:
df.groupby('Firmy').describe().transpose()['APP']

Sprzedaż  count      2.000000
          mean     232.000000
          std      152.735065
          min      124.000000
          25%      178.000000
          50%      232.000000
          75%      286.000000
          max      340.000000
Name: APP, dtype: float64

In [23]:
df.groupby('Firmy').describe().transpose()['APP'][0]

2.0